# to highlight the file, it's parsed as a Shell script
# shellcheck disable=SC2148,SC1083
### ! TAPS ###

tap "buo/cask-upgrade"
tap "hashicorp/tap"
tap "knative/client"
tap "kubescape/tap"
tap "txn2/tap"
tap "fairwindsops/tap"
tap "guumaster/tap"
tap "domt4/autoupdate"
tap "eth-p/software"
tap "mikescher/tap"
tap "oven-sh/bun"

### ! CASKS ###

# QuickLook
cask "syntax-highlight", args: { appdir: "/Applications/My/QuickLook" }
cask "qlmarkdown", args: { appdir: "/Applications/My/QuickLook" }
cask "betterzip", args: { appdir: "/Applications/My/QuickLook" }
cask "qlvideo", args: { appdir: "/Applications/My/QuickLook" }
cask "jupyter-notebook-viewer", args: { appdir: "/Applications/My/QuickLook" }

# General
cask "telegram", args: { appdir: "/Applications/My" }
cask "google-chrome", args: { appdir: "/Applications/My" }
cask "qbittorrent@lt20", args: { appdir: "/Applications/My" }
cask "yandex-music", args: { appdir: "/Applications/My" }
cask "iina", args: { appdir: "/Applications/My" }
cask "maccy", args: { appdir: "/Applications/My" }
cask "netnewswire", args: { appdir: "/Applications/My" }
cask "obsidian", args: { appdir: "/Applications/My" }
cask "syncthing-app", args: { appdir: "/Applications/My" }
cask "skim", args: { appdir: "/Applications/My" }
cask "maintenance", args: { appdir: "/Applications/My" }

cask "adguard"
cask "android-platform-tools"

# Programming
cask "visual-studio-code", args: { appdir: "/Applications/My/Programming" }
cask "wezterm", args: { appdir: "/Applications/My/Programming" }
cask "jetbrains-toolbox", args: { appdir: "/Applications/My/Programming/JetBrains" }
cask "orbstack", args: { appdir: "/Applications/My/Programming" }

cask "font-jetbrains-mono-nerd-font"

### ! FORMULAES ###

### ? Core ###
brew "bash"
brew "zsh"

# cannot use `uutils-coreutils` because `bats-core` requires GNU `coreutils`
brew "coreutils"
brew "findutils"
brew "diffutils"

brew "grep"
brew "ugrep"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "openssh"
brew "tree"
brew "make"
brew "less"
brew "lesspipe"
brew "file-formula"
brew "curl"
brew "wget"
brew "man-db"

brew "pv"
brew "rename"
brew "parallel"
brew "rsync"

brew "zip"
brew "gzip"
brew "pigz"
brew "sevenzip"

### ? Shell ###
brew "micro"
brew "zoxide"
brew "atuin"
brew "starship"
brew "chezmoi"
brew "eza"
brew "bat"
brew "eth-p/software/bat-extras-batman"
brew "git-delta"
brew "viddy"

# Monitoring
brew "btop"
brew "procs"
brew "proctools"
brew "dua-cli"

# Search
brew "fd"
brew "fzf"
brew "ripgrep-all"
brew "yazi"

# Cheatsheets
brew "tealdeer"
brew "cheat"
brew "eg-examples"

### ? Misc ###
brew "mas"
brew "jackett"
brew "yt-dlp"
brew "speedtest-cli"

# Formats
brew "ffmpeg"
brew "imagemagick"
brew "pandoc"
brew "poppler"

### ? DevOps ###

brew "jq"
brew "jaq"
brew "jnv"
brew "jc"
brew "yq"

brew "lsof"
brew "nmap"
brew "netcat"
brew "bind" # DNS tools
brew "guumaster/tap/hostctl"

brew "mikescher/tap/dops"
brew "hyperfine"
brew "vegeta"
brew "age"
brew "mkcert"
brew "act"
brew "gitlab-ci-local"

brew "awscli"
brew "minio-mc"

# K8s
brew "kubecolor"
brew "krew"
brew "kubectx"
brew "stern"
brew "kubelogin"
brew "txn2/tap/kubefwd"
brew "knative/client/kn"
brew "k9s"
brew "helmfile"
brew "helm-docs"
brew "argocd"
brew "sops"
brew "minikube"
brew "hashicorp/tap/vault"
brew "vcluster"

# K8s Linters
brew "kube-linter"
brew "kube-score"
brew "kubeconform"
brew "kubent"
brew "kics"
brew "kubescape/tap/kubescape-cli"
brew "chart-testing"
brew "popeye"
brew "checkov"
brew "operator-sdk"
brew "fairwindsops/tap/pluto"
brew "fairwindsops/tap/nova"
brew "fairwindsops/tap/polaris"

### ? Development ###

brew "git"
brew "git-lfs"
brew "gh"
brew "glab"

brew "mise"
brew "uv"
brew "oven-sh/bun/bun"
brew "just"
brew "tokei"
brew "git-cliff"
brew "exercism"
brew "yaegi"

brew "plantuml"
brew "structurizr-cli"

# Linting and Formatting
brew "pre-commit"
brew "shellcheck"
brew "shfmt"
brew "dotenv-linter"
brew "commitizen"
brew "editorconfig-checker"
brew "hadolint"
brew "bats-core"

### ! MAS ###
mas "refined-github", id: 1519867270
mas "github-file-icons", id: 1631366167
mas "toggl-track-hours-time-log", id: 1291898086
