42crunch.vscode-openapi
aaron-bond.better-comments
ahmadalli.vscode-nginx-conf
akamud.vscode-theme-onelight
antfu.file-nesting
anthropic.claude-code
astral-sh.ty
biomejs.biome
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
chadalen.vscode-jetbrains-icon-theme
charliermarsh.ruff
christian-kohler.path-intellisense
davidanson.vscode-markdownlint
docker.docker
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
george-alisson.html-preview-vscode
ginfuru.ginfuru-better-solarized-dark-theme
golang.go
hashicorp.terraform
hediet.vscode-drawio
iliazeus.vscode-ansi
janisdd.vscode-edit-csv
jbockle.jbockle-format-files
jebbs.plantuml
jnoortheen.nix-ide
k--kato.intellij-idea-keybindings
kevinrose.vsc-python-indent
mechatroner.rainbow-csv
mikestead.dotenv
moshfeu.compare-folders
ms-azuretools.vscode-containers
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.python
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-powertoys
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
mtxr.sqltools
openai.chatgpt
qwtel.sqlite-viewer
redhat.vscode-xml
redhat.vscode-yaml
renan-r-santos.pixi-code
rust-lang.rust-analyzer
skellock.just
slevesque.vscode-zipexplorer
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-russian
sumneko.lua
systemticks.c4-dsl-extension
tamasfe.even-better-toml
timonwong.shellcheck
tomoki1207.pdf
uloco.theme-bluloco-light
usernamehw.errorlens
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
