### ? TAPS ###

tap "hashicorp/tap"
tap "knative/client"
tap "kubescape/tap"
tap "fairwindsops/tap"
tap "guumaster/tap"

### ? CASKS ###

# QuickLook
cask "syntax-highlight", args: { appdir: "/Applications/My/QuickLook" }
cask "qlmarkdown", args: { appdir: "/Applications/My/QuickLook" }
cask "betterzip", args: { appdir: "/Applications/My/QuickLook" }
cask "qlvideo", args: { appdir: "/Applications/My/QuickLook" }
cask "jupyter-notebook-viewer", args: { appdir: "/Applications/My/QuickLook" }

# General
cask "telegram", args: { appdir: "/Applications/My" }
cask "chatgpt", args: { appdir: "/Applications/My" }
cask "google-chrome", args: { appdir: "/Applications/My" }
cask "qbittorrent@lt20", args: { appdir: "/Applications/My" }
cask "yandex-music", args: { appdir: "/Applications/My" }
cask "vlc", args: { appdir: "/Applications/My" }

# Programming
cask "visual-studio-code", args: { appdir: "/Applications/My/Programming" }
cask "wezterm", args: { appdir: "/Applications/My/Programming" }
cask "jetbrains-toolbox", args: { appdir: "/Applications/My/Programming/JetBrains" }
cask "orbstack", args: { appdir: "/Applications/My/Programming" }
cask "drawio", args: { appdir: "/Applications/My/Programming" }

cask "adguard"
cask "font-jetbrains-mono-nerd-font"
cask "miniforge"

### ? FORMULAES ###

# Essentials
brew "micro"
brew "zsh"
brew "bash"
brew "curl"
brew "wget"
brew "starship"
brew "chezmoi"
brew "mas"

brew "git"
brew "gh"
brew "git-lfs"

brew "coreutils"
brew "findutils"
brew "gawk"
brew "grep"
brew "gnu-tar"
brew "gnu-sed"
brew "openssh"
brew "rsync"
brew "make"
brew "less"

brew "sevenzip"
brew "gzip"
brew "pigz"

brew "ffmpeg"
brew "pv"
brew "rename"
brew "parallel"
brew "jq"
brew "jaq"
brew "jnv"
brew "jc"
brew "yq"
brew "mise"
brew "uv"
brew "pre-commit"
brew "shellcheck"
brew "shfmt"

# Tools
brew "lsd"
brew "bat"
brew "git-delta"
brew "viddy"
brew "procs"
brew "fd"
brew "sd"
brew "fzf"
brew "ripgrep"
brew "tldr"
brew "ncdu"
brew "just"
brew "hyperfine"
brew "age"
brew "tokei"
brew "lazydocker"
brew "lazygit"
brew "speedtest-cli"
brew "guumaster/tap/hostctl"
brew "awscli"
brew "mc"
brew "vegeta"
brew "yt-dlp"
brew "zoxide"
brew "btop"
brew "atuin"

# Kubernetes
brew "kubernetes-cli"
brew "kubecolor"
brew "krew"
brew "kubectx"
brew "stern"
brew "knative/client/kn"
brew "k9s"
brew "helm"
brew "helmfile"
brew "argocd"
brew "sops"
brew "minikube"
brew "hashicorp/tap/vault"

# Linters
brew "kube-linter"
brew "kube-score"
brew "kubeconform"
brew "kubent"
brew "kics"
brew "kubescape/tap/kubescape-cli"
brew "chart-testing"
brew "popeye"
brew "checkov"
brew "operator-sdk"
brew "fairwindsops/tap/pluto"
brew "fairwindsops/tap/nova"
brew "fairwindsops/tap/polaris"

### ? MAS ###
mas "refined-github", id: 1519867270
mas "github-file-icons", id: 1631366167
